app/controllers/sessions_controller.rb

  def index
    if User.exists?(session[:user_id])
      render text: "session id = #{session[:user_id]}, user email = #{User.find(session[:user_id]).email}"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 24]]