app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "asdf@sdf"]]
INSERT INTO "users" ("email", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "qqq@qqq"], ["password_hash", "$2a$10$xcHpd6IRZlSIqf/HYkjvMuSaMApNFKApxh/yZnf6cK5ri3q/fDZPy"], ["created_at", "2015-08-25 22:25:45.473281"], ["updated_at", "2015-08-25 22:25:45.473281"]]
---
  def create
    if !User.find_by_email(user_signup_params[:email])
       if user_signup_params[:password] == user_signup_params[:password_confirm]
        @user = User.new(user_signup_params)
        @user.save